cmsis-svd/cmsis-svd/data/GigaDevice/GD32F20x.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DBG</name>
      <description>Debug support</description>
      <groupName>DBG</groupName>
      <baseAddress>0xE0042000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>ID</name>
          <displayName>ID</displayName>
          <description>ID code register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ID_CODE</name>
              <description>DBG ID code register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CTL</name>
          <displayName>CTL</displayName>
          <description>Control register </description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SLP_HOLD</name>
              <description>Sleep mode hold register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DSLP_HOLD</name>
              <description>Deep-sleep mode hold register</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
             </field>
            <field>
              <name>STB_HOLD</name>
              <description>Standby mode hold register</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
             </field>
            <field>
              <name>TRACE_IOEN</name>
              <description>Trace pin allocation enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
             </field>
            <field>
              <name>TRACE_MODE</name>
              <description>Trace pin allocation mode</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>FWDGT_HOLD</name>
              <description>FWDGT hold bit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WWDGT_HOLD</name>
              <description>WWDGT hold bit</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER0_HOLD</name>
              <description>TIMER 0 hold bit</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER1_HOLD</name>
              <description>TIMER 1 hold bit</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER2_HOLD</name>
              <description>TIMER 2 hold bit</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER3_HOLD</name>
              <description>TIMER 23 hold bit</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>            
             <field>
              <name>CAN0_HOLD</name>
              <description>CAN0 hold bit</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>            
	    <field>
              <name>I2C0_HOLD</name>
              <description>I2C0 hold bit</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C1_HOLD</name>
              <description>I2C1 hold bit</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
	   <field>
              <name>TIMER4_HOLD</name>
              <description>TIMER 4 hold bit</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
	   <field>
              <name>TIMER5_HOLD</name>
              <description>TIMER 5 hold bit</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>   
            <field>
              <name>TIMER6_HOLD</name>
              <description>TIMER 6 hold bit</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>    
            <field>
              <name>TIMER7_HOLD</name>
              <description>TIMER 7 hold bit</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>   
            <field>
              <name>CAN1_HOLD</name>
              <description>CAN1 hold bit</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>   
             <field>
              <name>TIMER11_HOLD</name>
              <description>TIMER 11 hold bit</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>   
             <field>
              <name>TIMER12_HOLD</name>
              <description>TIMER 12 hold bit</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>       
            <field>
              <name>TIMER13_HOLD</name>
              <description>TIMER 13 hold bit</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>        
            <field>
              <name>TIMER8_HOLD</name>
              <description>TIMER 8 hold bit</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>    
             <field>
              <name>TIMER9_HOLD</name>
              <description>TIMER 9 hold bit</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
             <field>
              <name>TIMER10_HOLD</name>
              <description>TIMER 10 hold bit</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
