cmsis-svd/cmsis-svd/data/GigaDevice/GD32F20x.svd
        <register>
          <name>L0PPF</name>
          <displayName>L0PPF</displayName>
          <description>Layer 0 packeted pixel format register</description>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PPF</name>
              <description>Packeted Pixel Format</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
      <register>
          <name>L1PPF</name>
          <displayName>L1PPF</displayName>
          <description>Layer 1 packeted pixel format register</description>
          <addressOffset>0x114</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PPF</name>
              <description>Packeted Pixel Format</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>L0SA</name>
          <displayName>L0SA</displayName>
          <description>Layer 0 specified alpha register</description>
          <addressOffset>0x98</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x000000FF</resetValue>
          <fields>
            <field>
              <name>SA</name>
              <description>Specified alpha</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
      <register>
          <name>L1SA</name>
          <displayName>L1SA</displayName>
          <description>Layer 1 specified alpha register</description>
          <addressOffset>0x118</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x000000FF</resetValue>
          <fields>
            <field>
              <name>SA</name>
              <description>Specified alpha</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>L0DC</name>
          <displayName>L0DC</displayName>
          <description>Layer 0 default color register</description>
          <addressOffset>0x9C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DCA</name>
              <description>The default color ALPHA</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DCR</name>
              <description>The default color  red</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
           <field>
              <name>DCG</name>
              <description>The default color  green</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DCB</name>
              <description>The default color  blue</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
      <register>
          <name>L1DC</name>
          <displayName>L1DC</displayName>
          <description>Layer 1 default color register</description>
          <addressOffset>0x11C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DCA</name>
              <description>The default color ALPHA</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DCR</name>
              <description>The default color  red</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
           <field>
              <name>DCG</name>
              <description>The default color  green</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DCB</name>
              <description>The default color  blue</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>L0BLEND</name>
          <displayName>L0BLEND</displayName>
          <description>Layer 0 blending register</description>
          <addressOffset>0xA0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000607</resetValue>
          <fields>
            <field>
              <name>ACF1</name>
              <description>Alpha Calculation Factor 1 of Blending Method</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>ACF2</name>
              <description>Alpha Calculation Factor 2 of Blending Method</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
      <register>
          <name>L1BLEND</name>
          <displayName>L1BLEND</displayName>
          <description>Layer 1 blending register</description>
          <addressOffset>0x120</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000607</resetValue>
          <fields>
            <field>
              <name>ACF1</name>
              <description>Alpha Calculation Factor 1 of Blending Method</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>ACF2</name>
              <description>Alpha Calculation Factor 2 of Blending Method</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
      <register>
          <name>L0FBADDR</name>
          <displayName>L0FBADDR</displayName>
          <description>Layer 0 frame base address register</description>
          <addressOffset>0xAC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FBADD</name>
              <description>Frame Buffer base Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>L1FBADDR</name>
          <displayName>L1FBADDR</displayName>
          <description>Layer 1 frame base address register</description>
          <addressOffset>0x12C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FBADD</name>
              <description>Frame Buffer base Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
      <register>
          <name>L0FLLEN</name>
          <displayName>L0FLLEN</displayName>
          <description>Layer 0 frame line length register</description>
          <addressOffset>0xB0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STDOFF</name>
              <description>Frame Buffer Stride Offset</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
            <field>
              <name>FLL</name>
              <description>Frame Line Length</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>L1FLLEN</name>
          <displayName>L1FLLEN</displayName>
          <description>Layer 1 frame line length register</description>
          <addressOffset>0x130</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STDOFF</name>
              <description>Frame Buffer Stride Offset</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
            <field>
              <name>FLL</name>
              <description>Frame Line Length</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>L0FTLN</name>
          <displayName>L0FTLN</displayName>
          <description>Layer 0 frame total line number register</description>
          <addressOffset>0xB4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FTLN</name>
              <description>Frame Total Line Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>L1FTLN</name>
          <displayName>L1FTLN</displayName>
          <description>Layer 1 frame total line number register</description>
          <addressOffset>0x134</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FTLN</name>
              <description>Frame Total Line Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
      <register>
          <name>L0LUT</name>
          <displayName>L0LUT</displayName>
          <description>Layer 0 look up table register</description>
          <addressOffset>0xC4</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TADD</name>
              <description>Look Up Table Write Address</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>TR</name>
              <description>Red Channel of a LUT entry</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
           <field>
              <name>TG</name>
              <description>Green channel of a LUT entry</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>TB</name>
              <description>Blue channel of a LUT entry</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
      <register>
          <name>L1LUT</name>
          <displayName>L1LUT</displayName>
          <description>Layer 1 look up table register</description>
          <addressOffset>0x144</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TADD</name>
              <description>Look Up Table Write Address</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>TR</name>
              <description>Red channel of a LUT entry</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
           <field>
              <name>TG</name>
              <description>Green channel of a LUT entry</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>TB</name>
              <description>Blue channel of a LUT entry</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
